[
  {
    "id": 1,
    "title": "artificial intelligence (Undergraduate)",
    "timestamp": "06 Feb 2026 22:14",
    "content": "**Course Title:** Artificial Intelligence Fundamentals (AIF)\n\n**Course Overview:**\n\nThis 4-week undergraduate course is designed to equip students with a comprehensive understanding of Artificial Intelligence (AI) concepts, principles, and techniques. By the end of the course, students will be familiar with the fundamental algorithms, tools, and industry applications of AI, preparing them for a career in this rapidly evolving field.\n\n**Learning Outcomes:**\n\nUpon completion of this course, students will be able to:\n\n1. Define AI, its significance, and its role in real-world applications\n2. Explain the difference between Machine Learning, Deep Learning, and Natural Language Processing\n3. Implement basic AI algorithms, such as Linear Regression, Decision Trees, and Neural Networks\n4. Develop and train AI models using popular frameworks (TensorFlow or PyTorch)\n5. Evaluate AI system performance using metrics (Precision, Recall, F1-score)\n6. Address bias in AI models and apply techniques for fairness and ethics in AI\n7. Communicate AI concepts and results to a non-technical audience\n\n**Week-wise Breakdown:**\n\n**Week 1: Introduction to Artificial Intelligence**\n\n* Overview of AI, its history, and current trends\n* Fundamentals of AI: Supervised, Unsupervised, and Reinforcement Learning\n* Basic algorithms: Linear Regression, Decision Trees\n* Tools and frameworks: TensorFlow or PyTorch\n* Reading Assignments\n\t+ \"How to Build a Mind\" by Alan Turing\n\t+ \"Artificial Intelligence: A Modern Approach\" by Stuart Russell and Peter Norvig\n* Practical Assignment: Implement a Linear Regression model using a chosen framework\n\n**Week 2: Machine Learning Fundamentals**\n\n* Introduction to Deep Learning: Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs)\n* Supervised and Unsupervised Learning: Neural Networks and Clustering\n* Dimensionality Reduction: PCA, t-SNE\n* Bias and Variance in Machine Learning\n* Case Study: Image and Text Classification\n* Reading Assignments\n\t+ \"Deep Learning\" by Ian Goodfellow, Yoshua Bengio, and Aaron Courville\n\t+ \"Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow\" by Aurélien Géron\n* Practical Assignment: Train a CNN model using a selected dataset\n\n**Week 3: Natural Language Processing (NLP)**\n\n* Fundamentals of NLP: Tokenization, Part-of-Speech Tagging, Sentiment Analysis\n* Named Entity Recognition (NER) and Entity Disambiguation\n* Text Generation and Machine Translation\n* Case Study: Sentiment Analysis for Product Reviews\n* Reading Assignments\n\t+ \"Speech and Language Processing\" by Daniel Jurafsky and James H. Martin\n\t+ \"NLTK Book\" by Steven Bird, Ewan Klein, and Edward Loper\n* Practical Assignment: Implement a Sentiment Analysis model using a NLP library (NLTK, spaCy)\n\n**Week 4: AI in Industry and Ethics**\n\n* AI in Healthcare: Medical Image Analysis and Diagnosis\n* AI in Finance: Stock Market Prediction and Portfolio Management\n* AI in Education: Personalized Learning and Adaptive Assessment\n* Industry Readiness: Interview preparation and resume building\n* Ethics in AI: Bias, Fairness, and Transparency\n* Case Study: Ethical AI in a Real-World Scenario\n* Reading Assignments\n\t+ \"AI in Medicine\" edited by Ajay Basu\n\t+ \"Artificial Intelligence and Its Implications for Society\" by Nick Bostrom\n* Practical Assignment: Develop a project proposal for an AI-based solution to an industry problem\n\n**Teaching Methodology:**\n\n* Lectures (50%): 2 hours per week, covering theoretical concepts\n* Practical Assignments (25%): Hands-on experience with AI tools and frameworks\n* Group Discussions (15%): Interactive sessions to clarify doubts and foster learning\n* Guest Lectures (10%): Industry experts to share real-world applications and experiences\n* Online Resources (10%): Supplemental materials and tutorials\n\n**Assessment Strategy:**\n\n* Weekly Assignments (40%): Individual and group assignments, including practical and theoretical components\n* Mid-Term Project (20%): Develop and present a basic AI model\n* Final Project (30%): Design and implement a comprehensive AI solution to an industry problem\n* Participation (10%): Class attendance, active participation, and engagement in discussions\n* Quizzes (30%): Regular assessments to gauge knowledge retention and understanding of concepts\n\nThis comprehensive curriculum will provide undergraduate students with a solid foundation in Artificial Intelligence, preparing them for a successful career in this industry.",
    "rubric": "**Bloom's Taxonomy Aligned Rubric for Artificial Intelligence Fundamentals (AIF) Course**\n\n**Knowledge (Comprehension, Application, Analysis, Synthesis, Evaluation)**\n\n**Comprehension (1.0-2.0)**\n\n* Can the student define AI, its significance, and its role in real-world applications? (Course Learning Outcome 1)\n* Can the student explain the difference between Machine Learning, Deep Learning, and Natural Language Processing? (Course Learning Outcome 2)\n\n**Application (3.0-4.0)**\n\n* Can the student implement basic AI algorithms, such as Linear Regression, Decision Trees, and Neural Networks? (Course Learning Outcome 3)\n* Can the student develop and train AI models using popular frameworks (TensorFlow or PyTorch)? (Course Learning Outcome 4)\n* Can the student evaluate AI system performance using metrics (Precision, Recall, F1-score)? (Course Learning Outcome 5)\n\n**Analysis (5.0-6.0)**\n\n* Can the student analyze the bias in AI models and apply techniques for fairness and ethics in AI? (Course Learning Outcome 6)\n* Can the student evaluate the effectiveness of different AI algorithms and techniques in solving real-world problems?\n\n**Synthesis (7.0-8.0)**\n\n* Can the student design and implement a comprehensive AI solution to an industry problem? (Final Project, Course Learning Outcome 7)\n* Can the student develop a project proposal for an AI-based solution to an industry problem? (Week 4, Course Learning Outcome 7)\n\n**Evaluation (9.0-10.0)**\n\n* Can the student critically evaluate the strengths and limitations of AI models and techniques?\n* Can the student apply AI principles and techniques to solve complex problems in real-world scenarios?\n\n**Assessment Breakdown**\n\n* Weekly Assignments (40%): Individual and group assignments, including practical and theoretical components\n\t+ Knowledge (20%): Comprehension, Application, Analysis\n\t+ Synthesis (10%): Design and implementation of AI solutions\n\t+ Evaluation (10%): Critical evaluation of AI models and techniques\n* Mid-Term Project (20%): Develop and present a basic AI model\n\t+ Application (12.5%): Implementation of AI algorithms and techniques\n\t+ Analysis (5%): Analysis of AI system performance\n\t+ Synthesis (2.5%): Design and implementation of AI solutions\n* Final Project (30%): Design and implement a comprehensive AI solution to an industry problem\n\t+ Synthesis (20%): Design and implementation of AI solutions\n\t+ Evaluation (10%): Critical evaluation of AI models and techniques\n* Participation (10%): Class attendance, active participation, and engagement in discussions\n* Quizzes (30%): Regular assessments to gauge knowledge retention and understanding of concepts\n\t+ Knowledge (20%): Comprehension, Application, Analysis\n\t+ Evaluation (10%): Critical evaluation of AI models and techniques\n\n**Learning Level Description**\n\n* 1.0-2.0: Novice - Demonstrates minimal understanding of AI concepts and principles\n* 3.0-4.0: Developing - Demonstrates some understanding of AI concepts and principles, but struggles with implementation and analysis\n* 5.0-6.0: Proficient - Demonstrates a solid understanding of AI concepts and principles, with some ability to analyze and evaluate AI models and techniques\n* 7.0-8.0: Advanced - Demonstrates a deep understanding of AI concepts and principles, with ability to design and implement comprehensive AI solutions\n* 9.0-10.0: Mastery - Demonstrates exceptional understanding of AI concepts and principles, with ability to critically evaluate and synthesize AI models and techniques.",
    "quiz": "Here are 5 Multiple Choice Questions (MCQs) based on the provided curriculum:\n\nQ1: What is the primary focus of Week 1 in the AIF course?\n\nA. Machine Learning Fundamentals\nB. Introduction to Artificial Intelligence\nC. Natural Language Processing (NLP)\nD. AI in Industry and Ethics\n\nAnswer: B\n\nQ2: Which AI frameworks are used in the AIF course for development and training of AI models?\n\nA. TensorFlow, PyTorch, and Scikit-learn\nB. Keras, TensorFlow, and PyTorch\nC. NLTK, spaCy, and pandas\nD. scikit-learn, pandas, and matplotlib\n\nAnswer: B\n\nQ3: What is the key concept addressed in the case study for Week 2?\n\nA. Sentiment Analysis for Product Reviews\nB. Image and Text Classification\nC. Bias and Variance in Machine Learning\nD. PCA and t-SNE for Dimensionality Reduction\n\nAnswer: B\n\nQ4: Which topic is specifically focused on in Week 3 of the AIF course?\n\nA. AI in Healthcare\nB. AI in Finance\nC. AI in Education\nD. Natural Language Processing (NLP)\n\nAnswer: D\n\nQ5: What is the primary mode of assessment for the AIF course?\n\nA. Mid-term and Final Exams\nB. Weekly Quizzes and Assignments\nC. Group Discussions and Class Participation\nD. Practical Assignments and Project Proposals\n\nAnswer: D"
  },
  {
    "id": 2,
    "title": "computer architecture (Postgraduate)",
    "timestamp": "06 Feb 2026 22:32",
    "content": "**Course Title:** Advanced Computer Architecture for Postgraduates\n\n**Subject Code:** CPG 501\n\n**Duration:** 8 weeks (90 contact hours)\n\n**Course Overview:**\n\nThis 8-week postgraduate course is designed to provide in-depth knowledge and skills in computer architecture, focusing on industry-readiness. Upon completion, students will be able to design, analyze, and optimize computer architectures using various metrics and tools. The course will cover fundamental concepts in computer architecture, advanced topics in processor design, cache hierarchy, memory hierarchy, and multicore and many-core architectures.\n\n**Learning Outcomes:**\n\nUpon completion of this course, students will be able to:\n\n1. Analyze the design of different computer architectures, including processor, cache, and memory hierarchies.\n2. Explain the principles of instruction-level parallelism and data-level parallelism.\n3. Apply performance metrics, such as CPI, throughput, and energy efficiency, to optimize computer architecture design.\n4. Evaluate the impact of hardware advancements, such as multicore and many-core technologies, on future computer architectures.\n5. Design and optimize computer architectures for power, area, and performance trade-offs.\n6. Analyze the performance of complex applications using various performance metrics.\n7. Apply architectural modeling and simulation techniques to analyze and optimize computer architectures.\n8. Design and implement hardware accelerators for specific tasks.\n\n**Week-wise Breakdown:**\n\n| Week # | Topic | Learning Objectives |\n| --- | --- | --- |\n| Week 1 | Introduction to Computer Architecture | Analyze different computer architectures, explain the role of computer architecture in system performance. |\n| Week 2 | Fundamentals of Computer Architecture | Understand the instruction set architecture (ISA), data path, control unit, arithmetic logic unit (ALU). |\n| Week 3 | Cache Hierarchy Design | Analyze cache performance metrics, design cache hierarchies, and evaluate cache optimization techniques. |\n| Week 4 | Memory Hierarchy Design | Understand the design of main memory, disk storage, and memory controllers. |\n| Week 5 | Multicore Architectures | Explain the benefits and challenges of multicore architectures, analyze performance metrics for multicore systems. |\n| Week 6 | Many-core Architectures | Introduce many-core architecture concepts, analyze energy efficiency and scalability in many-core systems. |\n| Week 7 | Instruction-Level Parallelism and Data-Level Parallelism | Explain ILP and DLPI concepts, analyze performance metrics for ILP and DLPI. |\n| Week 8 | Project and Review | Implement a computer architecture design project, review the entire course content. |\n\n**Teaching Methodology:**\n\n1. Lecture: 30% of the course time will be spent on lectures, with a mix of theoretical and practical explanations.\n2. Tutorial: 25% of the course time will be spent on tutorials, with hands-on practical exercises and problem-solving sessions.\n3. Workshops: 15% of the course time will be spent on workshops, with group projects and peer review sessions.\n4. Online Resources: Students will have access to online resources, including video lectures, readings, and case studies.\n5. Guest Lectures: Industry experts will deliver guest lectures to provide real-world insights into computer architecture design.\n\n**Assessment Strategy:**\n\n1. Quizzes (30%, Week 2, 5, 7): Short assessments to evaluate students' understanding of course materials.\n2. Assignments (20%, Week 3, 5, 7): Practical exercises and problem-solving assignments to evaluate students' skills in computer architecture design.\n3. Project (30%, Week 8): Students will design, implement, and present a computer architecture project.\n4. Final Exam (20%, Week 8): A comprehensive exam to evaluate students' knowledge and skills in computer architecture.\n\n**Assessment Criteria:**\n\n1. Quizzes: Content knowledge, understanding of concepts, and problem-solving skills.\n2. Assignments: Quality of work, practical skills, and ability to apply concepts to real-world problems.\n3. Project: Design quality, implementation, and presentation skills.\n4. Final Exam: Comprehensive knowledge and skills in computer architecture design and analysis.\n\nThis detailed academic curriculum is designed to meet the learning objectives of the course, with a mix of theoretical and practical components, and various assessment strategies to evaluate student learning.",
    "rubric": "Here's a Bloom's Taxonomy aligned rubric for the CPG 501 course:\n\n**Knowledge Dimension:**\n\n1. Recall (Week 2 Quiz, Week 8 Final Exam)\n\t* Content knowledge (20%): Students will recall and identify key terms, concepts, and principles in computer architecture.\n\t* Understanding (20%): Students will demonstrate understanding of concepts by explaining and describing them in their own words.\n2. Understanding (Week 3 Assignment, Week 5 Assignment)\n\t* Applying (30%): Students will apply concepts to practical scenarios, such as designing a cache hierarchy or evaluating the impact of hardware advancements.\n\t* Analyzing (20%): Students will analyze complex systems and evaluate the performance of different architectures.\n\n**Comprehension Dimension:**\n\n1. Applying (Week 5 Quiz, Week 7 Assignment)\n\t* Designing (30%): Students will design and implement computer architectures, applying concepts and principles to real-world problems.\n\t* Analyzing (20%): Students will analyze complex systems and evaluate the performance of different architectures.\n2. Analyzing (Week 6 Assignment, Week 8 Project)\n\t* Identifying (30%): Students will identify patterns, relationships, and trade-offs in computer architecture design.\n\t* Making Judgments (20%): Students will make informed judgments about the design of a computer architecture based on analysis and evaluation of various metrics.\n\n**Application Dimension:**\n\n1. Applying (Week 3 Assignment, Week 5 Assignment)\n\t* Designing (40%): Students will design and implement computer architectures, applying concepts and principles to real-world problems.\n\t* Analyzing (20%): Students will analyze complex systems and evaluate the performance of different architectures.\n2. Creating (Week 8 Project)\n\t* Designing (40%): Students will design and implement a computer architecture project, applying concepts and principles to a real-world problem.\n\n**Synthesis Dimension:**\n\n1. Creating (Week 8 Project)\n\t* Designing (90%): Students will design and implement a computer architecture project, applying concepts and principles to a real-world problem.\n2. Evaluating (Week 7 Assignment, Week 8 Final Exam)\n\t* Making Judgments (40%): Students will make informed judgments about the design of a computer architecture based on analysis and evaluation of various metrics.\n\n**Evaluation Dimension:**\n\n1. Evaluating (Week 7 Assignment, Week 8 Final Exam)\n\t* Making Judgments (90%): Students will make informed judgments about the design of a computer architecture based on analysis and evaluation of various metrics.\n\nBy using this Bloom's Taxonomy aligned rubric, instructors can assess student learning in terms of their knowledge, understanding, application, synthesis, and evaluation of concepts in computer architecture.\n\n**Assessment Points Breakdown:**\n\n1. Quizzes: Knowledge Dimension (20% each)\n\t* Recalling (20%\n\t* Understanding (20%)\n\t* Applying (20%)\n\t* Analyzing (20%)\n2. Assignments: Knowledge Dimension (15% each)\n\t* Applying (30%\n\t* Analyzing (20%)\n3. Project: Knowledge Dimension (30%)\n\t* Designing (30%)\n\t* Analyzing (20%)\n4. Final Exam: Knowledge Dimension (20%)\n\t* Recalling (20%)\n\t* Understanding (20%)\n\t* Applying (20%)\n\n**Note:** The percentages of each assessment point breakdown can be adjusted according to specific course requirements and instructor preferences.",
    "quiz": "Here are five multiple-choice questions (MCQs) based on the provided curriculum:\n\n**Q1:** What is the primary goal of the cache hierarchy in a computer architecture?\n\nA. To increase the main memory capacity.\nB. To improve instruction-level parallelism.\nC. To reduce memory access latency and enhance performance.\nD. To decrease energy consumption.\n\n**Answer:** C\n\n**Q2:** Which of the following performance metrics is used to measure the average time a processor spends on each clock cycle?\n\nA. CPI\nB. Throughput\nC. Energy Efficiency\nD. Clock Speed\n\n**Answer:** A\n\n**Q3:** What is the benefit of using a many-core architecture over a multicore architecture?\n\nA. Increased energy efficiency.\nB. Improved instruction-level parallelism.\nC. Enhanced data-level parallelism and scalability.\nD. Reduced memory access latency.\n\n**Answer:** C\n\n**Q4:** Which of the following components of a computer architecture is responsible for controlling the execution of instructions?\n\nA. Arithmetic Logic Unit (ALU)\nB. Control Unit (CU)\nC. Instruction Set Architecture (ISA)\nD. Bus\n\n**Answer:** B\n\n**Q5:** What is the primary objective of the final exam in the course?\n\nA. To evaluate the quality of the project implementation.\nB. To analyze the performance of complex applications.\nC. To assess comprehensive knowledge and skills in computer architecture design and analysis.\nD. To design and implement hardware accelerators for specific tasks.\n\n**Answer:** C"
  },
  {
    "id": 3,
    "title": "computer architecture (Undergraduate)",
    "timestamp": "06 Feb 2026 22:57",
    "content": "**Course Overview:**\n\nTitle: Fundamentals of Computer Architecture\n\nCredit Hours: 4 weeks, 4 credits per week\n\nDuration: 4 weeks\n\nDescription: This course is an introductory course designed to provide students with a comprehensive understanding of computer architecture. Students will gain knowledge of the fundamental concepts, design principles, and techniques used in modern computer systems. By the end of this course, students will be able to design, implement, and analyze computer systems, and will be ready to pursue careers in the field of computer engineering.\n\n**Learning Outcomes:**\n\nUpon completion of this course, students will be able to:\n\n1. Explain the basic concepts of computer architecture, including instruction sets, memory hierarchy, and input/output systems.\n2. Analyze and design computer systems, including instruction-level, register-level, and memory-level parallelism.\n3. Implement computer architectures using high-level programming languages and hardware description languages (HDLs).\n4. Evaluate the performance of computer systems, including pipelining, cache hierarchies, and virtual memory.\n5. Apply computer architecture principles to real-world problems and design new systems.\n\n**Week-wise Breakdown:**\n\nWeek 1: Introduction to Computer Architecture\n\n* Topics:\n\t+ Introduction to computer architecture\n\t+ Instruction sets and assembly language programming\n\t+ Memory hierarchy and addressing modes\n* Assignments:\n\t+ Homework: Write a simple Assembly Language program using a specific instruction set architecture (e.g., x86).\n\t+ Project: Implement a simple cache simulator using a programming language (e.g., Python).\n\nWeek 2: Instruction-Level Parallelism\n\n* Topics:\n\t+ Pipelining and pipeline stages\n\t+ Instruction-level parallelism and multi-threading\n\t+ Branch prediction and speculation\n* Assignments:\n\t+ Homework: Design and simulate a simple pipelined processor using HDLs (e.g., VHDL).\n\t+ Project: Implement a multi-threaded program using OpenMP.\n\nWeek 3: Memory and Input/Output Systems\n\n* Topics:\n\t+ Memory hierarchy and cache coherence protocols\n\t+ Input/output systems and peripherals\n\t+ Memory-mapped I/O and device drivers\n* Assignments:\n\t+ Homework: Design and simulate a simple memory hierarchy using HDLs (e.g., VHDL).\n\t+ Project: Implement a memory-mapped I/O interface using a programming language (e.g., C).\n\nWeek 4: Virtual Memory and Systems Performance\n\n* Topics:\n\t+ Virtual memory and paging\n\t+ Cache hierarchies and performance evaluation\n\t+ Systems performance metrics and optimization techniques\n* Assignments:\n\t+ Homework: Design and simulate a simple virtual memory system using HDLs (e.g., VHDL).\n\t+ Project: Evaluate the performance of a computer system and design optimization techniques using a programming language (e.g., Python).\n\n**Teaching Methodology:**\n\n1. Lectures: 4 hours/week, covering theoretical concepts and topics.\n2. Tutorials: 2 hours/week, for interactive discussions, problem-solving, and project work.\n3. Labs: 4 hours/week, for hands-on experience with computer architecture simulators, HDLs, and programming languages.\n4. Online resources: Additional resources will be provided through a learning management system (LMS), including readings, videos, and quizzes.\n\n**Assessment Strategy:**\n\n1. Homework assignments: 40%\n2. Projects: 30%\n3. Quizzes and in-class tests: 20%\n4. Final exam: 10%\n\nAssessment Rubrics will be provided for each assignment, detailing the evaluation criteria, weightage, and due dates. Regular feedback will be provided to students to ensure they are on track to achieve the learning outcomes. The final assessment will be based on a comprehensive project that demonstrates the ability to design, implement, and analyze computer systems. hasitha",
    "rubric": "**Bloom's Taxonomy Aligned Rubric for Fundamentals of Computer Architecture**\n\n**Learning Outcomes:**\n\nUpon completion of this course, students will be able to:\n\n1. **Explain** the basic concepts of computer architecture, including instruction sets, memory hierarchy, and input/output systems. (Knowledge)\n2. **Analyze** and design computer systems, including instruction-level, register-level, and memory-level parallelism. (Analysis)\n3. **Implement** computer architectures using high-level programming languages and hardware description languages (HDLs). (Synthesis)\n4. **Evaluate** the performance of computer systems, including pipelining, cache hierarchies, and virtual memory. (Evaluation)\n5. **Apply** computer architecture principles to real-world problems and design new systems. (Creation)\n\n**Assignment Rubrics:**\n\n**Homework Assignments (40%):**\n\n1. **Simple Assembly Language Program**:\n\t* **Knowledge** (30%):\n\t\t+ Explain the instruction set and assembly language programming concepts correctly.\n\t\t+ Implement a simple Assembly Language program using the provided instruction set architecture.\n\t* **Analysis** (20%):\n\t\t+ Identify the memory hierarchy and addressing modes used in the program.\n\t\t+ Explain the trade-offs between different instruction set architectures.\n2. **Cache Simulator**:\n\t* **Synthesis** (30%):\n\t\t+ Implement a simple cache simulator using a programming language (e.g., Python).\n\t\t+ Explain the design decisions made in the simulator.\n\t* **Evaluation** (20%):\n\t\t+ Evaluate the performance of the cache simulator.\n\t\t+ Explain the limitations of the cache simulator.\n\n**Project Assignments (30%):**\n\n1. **Pipeline Processor Design**:\n\t* **Synthesis** (30%):\n\t\t+ Design and simulate a simple pipelined processor using HDLs (e.g., VHDL).\n\t\t+ Explain the design decisions made in the processor.\n\t* **Analysis** (20%):\n\t\t+ Evaluate the performance of the pipelined processor.\n\t\t+ Explain the trade-offs between different pipeline configurations.\n2. **Memory-Mapped I/O Interface**:\n\t* **Synthesis** (30%):\n\t\t+ Implement a memory-mapped I/O interface using a programming language (e.g., C).\n\t\t+ Explain the design decisions made in the interface.\n\t* **Evaluation** (20%):\n\t\t+ Evaluate the performance of the memory-mapped I/O interface.\n\t\t+ Explain the limitations of the interface.\n3. **Optimization Techniques**:\n\t* **Evaluation** (30%):\n\t\t+ Evaluate the performance of a computer system.\n\t\t+ Explain the trade-offs between different optimization techniques.\n\t* **Synthesis** (20%):\n\t\t+ Design optimization techniques to improve the performance of the computer system.\n\t\t+ Explain the design decisions made in the optimization techniques.\n\n**Quizzes and In-Class Tests (20%):**\n\n1. **Understanding of Concepts** (40%):\n\t* **Knowledge** (20%):\n\t\t+ Explain the basic concepts of computer architecture, including instruction sets, memory hierarchy, and input/output systems.\n\t* **Analysis** (20%):\n\t\t+ Explain the trade-offs between different instruction set architectures.\n2. **Problem-Solving Skills** (30%):\n\t* **Synthesis** (20%):\n\t\t+ Design and simulate a simple computer system.\n\t\t+ Explain the design decisions made in the system.\n\t* **Evaluation** (20%):\n\t\t+ Evaluate the performance of the computer system.\n\t\t+ Explain the limitations of the system.\n3. **Critical Thinking** (30%):\n\t* **Evaluation** (30%):\n\t\t+ Evaluate the performance of a computer system.\n\t\t+ Explain the trade-offs between different optimization techniques.\n\n**Final Exam (10%):**\n\n* **Creation** (100%):\n\t+ Design and analyze a complex computer system.\n\t+ Explain the design decisions made in the system.\n\t+ Evaluate the performance of the system.\n\t+ Explain the limitations of the system.\n\nNote: The weights for each category are indicative and may be adjusted based on the instructor's discretion.",
    "quiz": "Here are 5 MCQs based on the provided curriculum:\n\nQ1: What is the primary purpose of a memory hierarchy in a computer system?\nA. To increase the speed of the system\nB. To decrease the power consumption of the system\nC. To provide a cache memory for fast access\nD. To reduce the cost of the system\n\nAnswer: C\n\nQ2: Which of the following is a characteristic of pipelining in computer architecture?\nA. It reduces the number of clock cycles required to execute instructions\nB. It increases the power consumption of the system\nC. It allows for instruction-level parallelism\nD. It slows down the system by introducing overhead\n\nAnswer: C\n\nQ3: What is the role of a virtual memory system in a computer?\nA. To provide a higher level of abstraction for user programs\nB. To allocate more memory than is physically available\nC. To improve the speed and efficiency of memory accesses\nD. To protect user programs from hardware crashes\n\nAnswer: C\n\nQ4: What is the primary advantage of using a register-level parallelism in computer architecture?\nA. It reduces the size of the instruction set\nB. It increases the speed of the system by reducing data transfer times\nC. It decreases the power consumption of the system\nD. It improves the fault tolerance of the system\n\nAnswer: B\n\nQ5: Which of the following is a key principle in designing computer architectures for optimal performance?\nA. Increasing the clock frequency of the processor\nB. Increasing the number of registers available in the system\nC. Minimizing the number of pipeline stages in the processor\nD. Optimizing the cache hierarchy for maximum hit rates\n\nAnswer: D"
  }
]